package lockDoor;

public class Ending {

	public void Ending() {

		System.out.print(
				"마침내 마지막 퍼즐을 풀고 탈출의 열쇠를 획득한 당신은 강의실 문을 열 수 있게 되었습니다.\r\n"
				+ "당신은 각각의 퍼즐을 풀며 점차 자신의 자바 프로그래밍 능력을 향상시켰습니다.\r\n"
				+ "각 문제를 해결할 때마다 자신의 실력을 확인하고 성장함을 느끼고 있습니다.\r\n"
				+ "문을 열고 나가는 순간, 자바 마스터가 당신을 칭찬하며 맞이합니다.\r\n" 
				+ "그리고 당신이 자바 프로그래밍의 마스터가 되었다는 것을 축하합니다.\r\n"
				+ "당신은 강의실을 나가면서 왠지 모를 찝찝을 느낍니다.\r\n" 
				+ "하지만 상관없습니다.\r\n"
				+ "당신은 이제 더 넓은 세계로 나아가 자신의 능력을 발휘할 수 있게 되었습니다.\r\n" 
				+ "그리고 강의실을 떠나며 당신은 이 모험을 돌이켜보며 뿌듯함과 만족감을 느낍니다.\r\n"
			    + "당신은 집으로 돌아와서 휴식을 취하고 있을 때, 갑자기 당신은 한가지 사실을 깨닫습니다.\r\n"
				+ "바로 강의실을 떠날 때 지문을 찍지 않았다는 사실입니다.\r\n"
				+ "\"어떻게 이런 일이...\" 당신은 자신의 무심한 행동에 대해 후회하며 어쩔 줄 모르게 됩니다. \r\n" + "갑자기 자바 마스터의 말이 떠오릅니다.\r\n"
				+ "\"잊지 말아야 할 것이 있어요. 모든 입실에는 퇴실이 따르는 법이죠\"");

	}

}
